Applying this in dev/10

```
Note: Objects have changed outside of Terraform

Terraform detected the following changes made outside of Terraform since the
last "terraform apply" which may have affected this plan:

  # module.vpc.aws_subnet.private[0] has changed
  ~ resource "aws_subnet" "private" {
        id                                             = "subnet-04e4a9e27b99c789d"
      ~ tags                                           = {
          - "Managed"     = "terraform" -> null
          - "Stack"       = "master" -> null
            # (3 unchanged elements hidden)
        }
        # (15 unchanged attributes hidden)
    }

  # module.vpc.aws_subnet.private[1] has changed
  ~ resource "aws_subnet" "private" {
        id                                             = "subnet-007b884976a978d38"
      ~ tags                                           = {
          - "Managed"     = "terraform" -> null
          - "Stack"       = "master" -> null
            # (3 unchanged elements hidden)
        }
        # (15 unchanged attributes hidden)
    }

  # module.vpc.aws_subnet.private[2] has changed
  ~ resource "aws_subnet" "private" {
        id                                             = "subnet-02063a778a264e849"
      ~ tags                                           = {
          - "Managed"     = "terraform" -> null
          - "Stack"       = "master" -> null
            # (3 unchanged elements hidden)
        }
        # (15 unchanged attributes hidden)
    }

  # module.vpc.aws_subnet.public[0] has changed
  ~ resource "aws_subnet" "public" {
        id                                             = "subnet-080ad05b652154fdf"
      ~ tags                                           = {
          - "Managed"     = "terraform" -> null
          - "Stack"       = "master" -> null
            # (3 unchanged elements hidden)
        }
        # (15 unchanged attributes hidden)
    }

  # module.vpc.aws_subnet.public[1] has changed
  ~ resource "aws_subnet" "public" {
        id                                             = "subnet-0ebda03f040a67ce1"
      ~ tags                                           = {
          - "Managed"     = "terraform" -> null
          - "Stack"       = "master" -> null
            # (3 unchanged elements hidden)
        }
        # (15 unchanged attributes hidden)
    }

  # module.vpc.aws_subnet.public[2] has changed
  ~ resource "aws_subnet" "public" {
        id                                             = "subnet-02d3b4509dc144435"
      ~ tags                                           = {
          - "Managed"     = "terraform" -> null
          - "Stack"       = "master" -> null
            # (3 unchanged elements hidden)
        }
        # (15 unchanged attributes hidden)
    }

  # module.consul_server.module.asg.aws_lb_target_group.this[0] has changed
  ~ resource "aws_lb_target_group" "this" {
        id                                 = "arn:aws:elasticloadbalancing:eu-central-1:175932657549:targetgroup/consul-server-master/cad9eceb611b2a4c"
        name                               = "consul-server-master"
      ~ tags                               = {
          - "Managed"     = "terraform" -> null
          - "Stack"       = "master" -> null
            # (1 unchanged element hidden)
        }
        # (14 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }


Unless you have made equivalent changes to your configuration, or ignored the
relevant attributes using ignore_changes, the following plan may include
actions to undo or respond to these changes.

─────────────────────────────────────────────────────────────────────────────

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  ~ update in-place
+/- create replacement and then destroy
 <= read (data resources)

Terraform will perform the following actions:

  # data.aws_iam_policy_document.mufasa will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "aws_iam_policy_document" "mufasa" {
      + id   = (known after apply)
      + json = (known after apply)

      + statement {
          + actions   = [
              + "s3:PutObject",
            ]
          + effect    = "Allow"
          + resources = [
              + "arn:aws:s3:::edgelab-dev-tic-mufasa-master/*",
            ]
        }
    }

  # aws_iam_policy.describe_ec2 will be updated in-place
  ~ resource "aws_iam_policy" "describe_ec2" {
        id        = "arn:aws:iam::175932657549:policy/master_describe_ec2"
        name      = "master_describe_ec2"
        tags      = {}
      ~ tags_all  = {
          + "Managed" = "terraform"
          + "Stack"   = "master"
        }
        # (4 unchanged attributes hidden)
    }

  # aws_iam_policy.mufasa will be updated in-place
  ~ resource "aws_iam_policy" "mufasa" {
        id        = "arn:aws:iam::175932657549:policy/mufasa-master"
        name      = "mufasa-master"
      ~ policy    = jsonencode(
            {
              - Statement = [
                  - {
                      - Action   = "s3:PutObject"
                      - Effect   = "Allow"
                      - Resource = "arn:aws:s3:::edgelab-dev-tic-mufasa-master/*"
                      - Sid      = ""
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> (known after apply)
        tags      = {}
      ~ tags_all  = {
          + "Managed" = "terraform"
          + "Stack"   = "master"
        }
        # (3 unchanged attributes hidden)
    }

  # aws_s3_bucket.mufasa will be updated in-place
  ~ resource "aws_s3_bucket" "mufasa" {
        id                          = "edgelab-dev-tic-mufasa-master"
      ~ tags                        = {
          + "Managed" = "terraform"
          + "Stack"   = "master"
            # (1 unchanged element hidden)
        }
        # (10 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # aws_secretsmanager_secret.ssh_bastion will be updated in-place
  ~ resource "aws_secretsmanager_secret" "ssh_bastion" {
        id                             = "arn:aws:secretsmanager:eu-central-1:175932657549:secret:consul/master/ssh-bastion-lw72y2"
        name                           = "consul/master/ssh-bastion"
        tags                           = {
            "ConsulCluster" = "master"
            "EdgelabRole"   = "ssh-bastion"
        }
      ~ tags_all                       = {
          + "Managed"       = "terraform"
          + "Stack"         = "master"
            # (2 unchanged elements hidden)
        }
        # (4 unchanged attributes hidden)
    }

  # aws_secretsmanager_secret.wireguard_ci will be updated in-place
  ~ resource "aws_secretsmanager_secret" "wireguard_ci" {
        id                             = "arn:aws:secretsmanager:eu-central-1:175932657549:secret:wireguard/master/wg0.conf-xw3i74"
        name                           = "wireguard/master/wg0.conf"
        tags                           = {}
      ~ tags_all                       = {
          + "Managed" = "terraform"
          + "Stack"   = "master"
        }
        # (4 unchanged attributes hidden)
    }

  # aws_security_group.wireguard will be updated in-place
  ~ resource "aws_security_group" "wireguard" {
        id                     = "sg-0af8e0bcbc9ac8e0e"
        name                   = "Wireguard: master"
        tags                   = {}
      ~ tags_all               = {
          + "Managed" = "terraform"
          + "Stack"   = "master"
        }
        # (7 unchanged attributes hidden)
    }

  # module.consul_server.aws_iam_instance_profile.consul_server will be updated in-place
  ~ resource "aws_iam_instance_profile" "consul_server" {
        id          = "consul-server-master"
        name        = "consul-server-master"
        tags        = {}
      ~ tags_all    = {
          + "Managed" = "terraform"
          + "Stack"   = "master"
        }
        # (5 unchanged attributes hidden)
    }

  # module.consul_server.aws_iam_policy.consul_server_secrets will be updated in-place
  ~ resource "aws_iam_policy" "consul_server_secrets" {
        id        = "arn:aws:iam::175932657549:policy/consul-server-master"
        name      = "consul-server-master"
        tags      = {}
      ~ tags_all  = {
          + "Managed" = "terraform"
          + "Stack"   = "master"
        }
        # (4 unchanged attributes hidden)
    }

  # module.consul_server.aws_iam_role.consul_server will be updated in-place
  ~ resource "aws_iam_role" "consul_server" {
        id                    = "consul-server-master"
        name                  = "consul-server-master"
        tags                  = {}
      ~ tags_all              = {
          + "Managed" = "terraform"
          + "Stack"   = "master"
        }
        # (8 unchanged attributes hidden)
    }

  # module.consul_server.aws_secretsmanager_secret.consul_secrets will be updated in-place
  ~ resource "aws_secretsmanager_secret" "consul_secrets" {
        id                             = "arn:aws:secretsmanager:eu-central-1:175932657549:secret:master/consul-server-mG5nO8"
        name                           = "master/consul-server"
        tags                           = {
            "ConsulCluster" = "master"
            "EdgelabRole"   = "consul-server"
        }
      ~ tags_all                       = {
          + "Managed"       = "terraform"
          + "Stack"         = "master"
            # (2 unchanged elements hidden)
        }
        # (4 unchanged attributes hidden)
    }

  # module.ssh_bastion.aws_iam_instance_profile.bastion will be updated in-place
  ~ resource "aws_iam_instance_profile" "bastion" {
        id          = "ssh-bastion-master"
        name        = "ssh-bastion-master"
        tags        = {}
      ~ tags_all    = {
          + "Managed" = "terraform"
          + "Stack"   = "master"
        }
        # (5 unchanged attributes hidden)
    }

  # module.ssh_bastion.aws_iam_role.bastion will be updated in-place
  ~ resource "aws_iam_role" "bastion" {
        id                    = "ssh-bastion-master"
        name                  = "ssh-bastion-master"
        tags                  = {}
      ~ tags_all              = {
          + "Managed" = "terraform"
          + "Stack"   = "master"
        }
        # (8 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # module.vpc.aws_vpc_endpoint.interface["ec2"] will be updated in-place
  ~ resource "aws_vpc_endpoint" "interface" {
        id                    = "vpce-01d54f40d672dce60"
        tags                  = {}
      ~ tags_all              = {
          + "Managed" = "terraform"
          + "Stack"   = "master"
        }
        # (16 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # module.vpc.aws_vpc_endpoint.interface["ecr.dkr"] will be updated in-place
  ~ resource "aws_vpc_endpoint" "interface" {
        id                    = "vpce-093b0002b606b53d1"
        tags                  = {}
      ~ tags_all              = {
          + "Managed" = "terraform"
          + "Stack"   = "master"
        }
        # (16 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # module.vpc.aws_vpc_endpoint.interface["secretsmanager"] will be updated in-place
  ~ resource "aws_vpc_endpoint" "interface" {
        id                    = "vpce-0de8e77145a3aff65"
        tags                  = {}
      ~ tags_all              = {
          + "Managed" = "terraform"
          + "Stack"   = "master"
        }
        # (16 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # module.vpc.aws_vpc_endpoint.interface["sqs"] will be updated in-place
  ~ resource "aws_vpc_endpoint" "interface" {
        id                    = "vpce-01eb19056d2d58476"
        tags                  = {}
      ~ tags_all              = {
          + "Managed" = "terraform"
          + "Stack"   = "master"
        }
        # (16 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # module.vpc.aws_vpc_endpoint.s3 will be updated in-place
  ~ resource "aws_vpc_endpoint" "s3" {
        id                    = "vpce-036bc5b8980e42d94"
        tags                  = {}
      ~ tags_all              = {
          + "Managed" = "terraform"
          + "Stack"   = "master"
        }
        # (16 unchanged attributes hidden)
    }

  # module.consul_server.module.asg.data.aws_iam_policy_document.lifecycle_hook will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "aws_iam_policy_document" "lifecycle_hook" {
      + id   = (known after apply)
      + json = (known after apply)

      + statement {
          + actions   = [
              + "autoscaling:CompleteLifecycleAction",
              + "autoscaling:RecordLifecycleActionHeartbeat",
            ]
          + effect    = "Allow"
          + resources = [
              + "*",
            ]

          + condition {
              + test     = "StringEquals"
              + values   = [
                  + "Consul Server",
                ]
              + variable = "autoscaling:ResourceTag/Name"
            }
          + condition {
              + test     = "StringEquals"
              + values   = [
                  + "consul-server-master",
                ]
              + variable = "autoscaling:ResourceTag/UniqueName"
            }
        }
    }

  # module.consul_server.module.asg.data.cloudinit_config.user_data will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "cloudinit_config" "user_data" {
      + base64_encode = false
      + gzip          = false
      + id            = (known after apply)
      + rendered      = (known after apply)

      + part {
          + content      = <<-EOT
                "mufasa":
                  "enabled": true
                  "heartbeat_timeout": 600
                  "plugin_configs":
                  - "consul":
                      "token_secret_id": "arn:aws:secretsmanager:eu-central-1:175932657549:secret:master/consul-server-mG5nO8"
                      "token_secret_path": "consul.acl.tokens.master"
                  "plugins":
                  - "cloud-init"
                  - "consul"
                  "report_bucket": "edgelab-dev-tic-mufasa-master"
                  "sqs_queue": "consul-server-master"
            EOT
          + content_type = "application/yaml"
          + filename     = "/etc/mufasa/config.yml"
          + merge_type   = "list(append)+dict(no_replace,recurse_list)+str(append)"
        }
      + part {
          + content      = <<-EOT
                #cloud-config
                
                edgelab_instance_prefix: "consul-server-"
                
                runcmd:
                  
                  - edgelab-bootstrap
                
                write_files:
                - path: /etc/salt/minion.d/secrets.conf
                  content: |
                    secret_path: master/consul-server
                
                - path: /etc/salt/minion.d/grains.consul.conf
                  encoding: b64
                  content: ImdyYWlucyI6CiAgImNvbnN1bCI6CiAgICAiYXV0b2pvaW4iOgogICAgICAiYXdzIjoKICAgICAgICAiYWRkcl90eXBlIjogInByaXZhdGVfdjQiCiAgICAgICAgInJlZ2lvbiI6ICJldS1jZW50cmFsLTEiCiAgICAgICAgInRhZ19rZXkiOiAiQ29uc3VsQ2x1c3RlciIKICAgICAgICAidGFnX3ZhbHVlIjogIm1hc3RlciIKICAgICJzZXJ2aWNlcyI6CiAgICAgICJjb25zdWwtdWkiOgogICAgICAgICJpZCI6ICJjb25zdWwtdWkiCiAgICAgICAgIm5hbWUiOiAiY29uc3VsLXVpIgogICAgICAgICJwb3J0IjogODUwMAogICAgICAgICJ0YWdzIjoKICAgICAgICAtICJjb25zdWwiCiAgICAgICAgLSAidHJhZWZpay50YWdzPWh0dHAtdG9vbHMiCiAgICAgICAgLSAidHJhZWZpay5mcm9udGVuZC5ydWxlPVBhdGhQcmVmaXg6IC91aSwvdjEsL2NvbnN1bCIKICAgICAgICAtICJ0cmFlZmlrLmZyb250ZW5kLnJlZGlyZWN0LnJlZ2V4PV5odHRwczovL1teL10qL2NvbnN1bCgkfC8uKikiCiAgICAgICAgLSAidHJhZWZpay5mcm9udGVuZC5yZWRpcmVjdC5yZXBsYWNlbWVudD0vdWkvIgogICAgInNldHRpbmdzIjoKICAgICAgImFjbCI6CiAgICAgICAgImRlZmF1bHRfcG9saWN5IjogImRlbnkiCiAgICAgICAgImRvd25fcG9saWN5IjogImV4dGVuZC1jYWNoZSIKICAgICAgICAiZW5hYmxlZCI6IHRydWUKICAgICAgICAidG9rZW5fdHRsIjogIjMwcyIKICAgICAgImJvb3RzdHJhcF9leHBlY3QiOiAzCiAgICAgICJkYXRhY2VudGVyIjogImF3cy1ldS1jZW50cmFsLTEiCiAgICAgICJsZWF2ZV9vbl90ZXJtaW5hdGUiOiBmYWxzZQogICAgICAicG9ydHMiOgogICAgICAgICJkbnMiOiA4NjAwCiAgICAgICAgImdycGMiOiAtMQogICAgICAgICJodHRwIjogODUwMAogICAgICAgICJodHRwcyI6IC0xCiAgICAgICAgInNlcmZfbGFuIjogODMwMQogICAgICAgICJzZXJmX3dhbiI6IDgzMDIKICAgICAgICAic2VydmVyIjogODMwMAogICAgICAic2VydmVyIjogdHJ1ZQogICAgICAidWkiOiB0cnVlCg==
                
                - path: /etc/consul.d/099-extra.json
                  encoding: b64
                  content: eyJhY2xfZW5mb3JjZV92ZXJzaW9uXzgiOmZhbHNlfQ==
                
                # vim:ft=yaml
            EOT
          + content_type = "text/cloud-config"
          + filename     = "init.cfg"
          + merge_type   = "list(append)+dict(no_replace,recurse_list)+str(append)"
        }
    }

  # module.consul_server.module.asg.aws_autoscaling_group.this will be updated in-place
  ~ resource "aws_autoscaling_group" "this" {
        id                        = "consul-server-master"
      ~ launch_configuration      = "consul-server-20220901142053410200000001" -> (known after apply)
        name                      = "consul-server-master"
        # (23 unchanged attributes hidden)

      + tag {
          + key                 = "MachineName"
          + propagate_at_launch = true
          + value               = "consul-server"
        }
      - tag {
          - key                 = "MachineName" -> null
          - propagate_at_launch = true -> null
          - value               = "consul-server-master" -> null
        }
      + tag {
          + key                 = "UniqueName"
          + propagate_at_launch = true
          + value               = "consul-server-master"
        }

        # (7 unchanged blocks hidden)
    }

  # module.consul_server.module.asg.aws_iam_policy.lifecycle_hook[0] will be updated in-place
  ~ resource "aws_iam_policy" "lifecycle_hook" {
        id        = "arn:aws:iam::175932657549:policy/consul-server-master-lifecycle-hook"
        name      = "consul-server-master-lifecycle-hook"
      ~ policy    = jsonencode(
            {
              - Statement = [
                  - {
                      - Action    = [
                          - "autoscaling:RecordLifecycleActionHeartbeat",
                          - "autoscaling:CompleteLifecycleAction",
                        ]
                      - Condition = {
                          - StringEquals = {
                              - "autoscaling:ResourceTag/MachineName" = "consul-server-master"
                              - "autoscaling:ResourceTag/Name"        = "Consul Server"
                              - "autoscaling:ResourceTag/Stack"       = "master"
                            }
                        }
                      - Effect    = "Allow"
                      - Resource  = "*"
                      - Sid       = ""
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> (known after apply)
        tags      = {}
      ~ tags_all  = {
          + "Managed" = "terraform"
          + "Stack"   = "master"
        }
        # (3 unchanged attributes hidden)
    }

  # module.consul_server.module.asg.aws_launch_configuration.this must be replaced
+/- resource "aws_launch_configuration" "this" {
      ~ arn                              = "arn:aws:autoscaling:eu-central-1:175932657549:launchConfiguration:077a2901-2064-4b05-a18d-6b9a4647ef2e:launchConfigurationName/consul-server-20220901142053410200000001" -> (known after apply)
      ~ ebs_optimized                    = false -> (known after apply)
      ~ id                               = "consul-server-20220901142053410200000001" -> (known after apply)
      + key_name                         = (known after apply)
      ~ name                             = "consul-server-20220901142053410200000001" -> (known after apply)
      ~ user_data                        = "b312a9027c496e3a2d44395cd7cd0204cf388f95" -> (known after apply) # forces replacement
      - vpc_classic_link_security_groups = [] -> null
        # (7 unchanged attributes hidden)

      + ebs_block_device {
          + delete_on_termination = (known after apply)
          + device_name           = (known after apply)
          + encrypted             = (known after apply)
          + iops                  = (known after apply)
          + no_device             = (known after apply)
          + snapshot_id           = (known after apply)
          + throughput            = (known after apply)
          + volume_size           = (known after apply)
          + volume_type           = (known after apply)
        }

      ~ metadata_options {
          ~ http_put_response_hop_limit = 1 -> (known after apply)
            # (2 unchanged attributes hidden)
        }

      ~ root_block_device {
          ~ iops                  = 0 -> (known after apply)
          ~ throughput            = 0 -> (known after apply)
          ~ volume_size           = 0 -> (known after apply)
          + volume_type           = (known after apply)
            # (2 unchanged attributes hidden)
        }
    }

  # module.consul_server.module.asg.aws_lb_target_group.this[0] will be updated in-place
  ~ resource "aws_lb_target_group" "this" {
        id                                 = "arn:aws:elasticloadbalancing:eu-central-1:175932657549:targetgroup/consul-server-master/cad9eceb611b2a4c"
        name                               = "consul-server-master"
      ~ tags                               = {
          + "UniqueName"  = "consul-server-master"
            # (1 unchanged element hidden)
        }
      ~ tags_all                           = {
          + "UniqueName"  = "consul-server-master"
            # (3 unchanged elements hidden)
        }
        # (13 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.consul_server.module.unique.random_string.suffix will be updated in-place
  ~ resource "random_string" "suffix" {
        id          = "fftM"
        # (12 unchanged attributes hidden)
    }

  # module.ssh_bastion.module.asg.aws_autoscaling_group.this will be updated in-place
  ~ resource "aws_autoscaling_group" "this" {
        id                        = "ssh-bastion-master"
      ~ launch_configuration      = "ssh-bastion-2022082413434571950000000a" -> (known after apply)
        name                      = "ssh-bastion-master"
        # (23 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # module.ssh_bastion.module.asg.aws_launch_configuration.this must be replaced
+/- resource "aws_launch_configuration" "this" {
      ~ arn                              = "arn:aws:autoscaling:eu-central-1:175932657549:launchConfiguration:02fdeb52-681b-44c1-bc91-14d601188605:launchConfigurationName/ssh-bastion-2022082413434571950000000a" -> (known after apply)
      ~ ebs_optimized                    = false -> (known after apply)
      ~ id                               = "ssh-bastion-2022082413434571950000000a" -> (known after apply)
      + key_name                         = (known after apply)
      ~ name                             = "ssh-bastion-2022082413434571950000000a" -> (known after apply)
      ~ user_data                        = "0e917d92090d53977bede7d1e5431186223d4423" -> "56dc4746bb7d11387b5aa37bd547a6aa0a4b5fa6" # forces replacement
      - vpc_classic_link_security_groups = [] -> null
        # (7 unchanged attributes hidden)

      + ebs_block_device {
          + delete_on_termination = (known after apply)
          + device_name           = (known after apply)
          + encrypted             = (known after apply)
          + iops                  = (known after apply)
          + no_device             = (known after apply)
          + snapshot_id           = (known after apply)
          + throughput            = (known after apply)
          + volume_size           = (known after apply)
          + volume_type           = (known after apply)
        }

      ~ metadata_options {
          ~ http_put_response_hop_limit = 1 -> (known after apply)
            # (2 unchanged attributes hidden)
        }

      ~ root_block_device {
          ~ iops                  = 0 -> (known after apply)
          ~ throughput            = 0 -> (known after apply)
          ~ volume_size           = 0 -> (known after apply)
          + volume_type           = (known after apply)
            # (2 unchanged attributes hidden)
        }
    }

  # module.ssh_bastion.module.unique.random_string.suffix will be updated in-place
  ~ resource "random_string" "suffix" {
        id          = "8Cyg"
        # (12 unchanged attributes hidden)
    }

  # module.consul_server.module.asg.module.policy_name.random_string.suffix will be updated in-place
  ~ resource "random_string" "suffix" {
        id          = "3HFx"
        # (12 unchanged attributes hidden)
    }

  # module.consul_server.module.asg.module.queue[0].data.aws_iam_policy_document.asg_assume_role will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "aws_iam_policy_document" "asg_assume_role" {
      + id   = (known after apply)
      + json = (known after apply)

      + statement {
          + actions = [
              + "sts:AssumeRole",
            ]

          + principals {
              + identifiers = [
                  + "autoscaling.amazonaws.com",
                ]
              + type        = "Service"
            }
        }
    }

  # module.consul_server.module.asg.module.queue[0].data.aws_iam_policy_document.sns will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "aws_iam_policy_document" "sns" {
      + id   = (known after apply)
      + json = (known after apply)

      + statement {
          + actions   = [
              + "sqs:GetQueueUrl",
              + "sqs:SendMessage",
            ]
          + resources = [
              + "arn:aws:sqs:eu-central-1:175932657549:consul-server-master",
            ]
        }
      + statement {
          + actions   = [
              + "sns:Publish",
            ]
          + resources = [
              + "arn:aws:sqs:eu-central-1:175932657549:consul-server-master",
            ]
        }
    }

  # module.consul_server.module.asg.module.queue[0].data.aws_iam_policy_document.sqs will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "aws_iam_policy_document" "sqs" {
      + id   = (known after apply)
      + json = (known after apply)

      + statement {
          + actions   = [
              + "sqs:ChangeMessageVisibility",
              + "sqs:DeleteMessage",
              + "sqs:GetQueueUrl",
              + "sqs:ReceiveMessage",
              + "sqs:SendMessage",
            ]
          + effect    = "Allow"
          + resources = [
              + "arn:aws:sqs:eu-central-1:175932657549:consul-server-master",
            ]
          + sid       = "ForMufasa"
        }
    }

  # module.consul_server.module.asg.module.queue[0].aws_iam_policy.sns will be updated in-place
  ~ resource "aws_iam_policy" "sns" {
        id          = "arn:aws:iam::175932657549:policy/consul-server-master-lifecycle"
        name        = "consul-server-master-lifecycle"
      ~ policy      = jsonencode(
            {
              - Statement = [
                  - {
                      - Action   = [
                          - "sqs:SendMessage",
                          - "sqs:GetQueueUrl",
                        ]
                      - Effect   = "Allow"
                      - Resource = "arn:aws:sqs:eu-central-1:175932657549:consul-server-master"
                      - Sid      = ""
                    },
                  - {
                      - Action   = "sns:Publish"
                      - Effect   = "Allow"
                      - Resource = "arn:aws:sqs:eu-central-1:175932657549:consul-server-master"
                      - Sid      = ""
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> (known after apply)
        tags        = {}
      ~ tags_all    = {
          + "Managed" = "terraform"
          + "Stack"   = "master"
        }
        # (4 unchanged attributes hidden)
    }

  # module.consul_server.module.asg.module.queue[0].aws_iam_policy.sqs will be updated in-place
  ~ resource "aws_iam_policy" "sqs" {
        id          = "arn:aws:iam::175932657549:policy/consul-server-master-sqs"
        name        = "consul-server-master-sqs"
      ~ policy      = jsonencode(
            {
              - Statement = [
                  - {
                      - Action   = [
                          - "sqs:SendMessage",
                          - "sqs:ReceiveMessage",
                          - "sqs:GetQueueUrl",
                          - "sqs:DeleteMessage",
                          - "sqs:ChangeMessageVisibility",
                        ]
                      - Effect   = "Allow"
                      - Resource = "arn:aws:sqs:eu-central-1:175932657549:consul-server-master"
                      - Sid      = "ForMufasa"
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> (known after apply)
        tags        = {}
      ~ tags_all    = {
          + "Managed" = "terraform"
          + "Stack"   = "master"
        }
        # (4 unchanged attributes hidden)
    }

  # module.consul_server.module.asg.module.queue[0].aws_iam_role.lifecycle will be updated in-place
  ~ resource "aws_iam_role" "lifecycle" {
      ~ assume_role_policy    = jsonencode(
            {
              - Statement = [
                  - {
                      - Action    = "sts:AssumeRole"
                      - Effect    = "Allow"
                      - Principal = {
                          - Service = "autoscaling.amazonaws.com"
                        }
                      - Sid       = ""
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> (known after apply)
        id                    = "consul-server-master-lifecycle"
        name                  = "consul-server-master-lifecycle"
        tags                  = {}
        # (9 unchanged attributes hidden)
    }

  # module.consul_server.module.asg.module.queue[0].aws_sqs_queue_policy.this will be updated in-place
  ~ resource "aws_sqs_queue_policy" "this" {
        id        = "https://sqs.eu-central-1.amazonaws.com/175932657549/consul-server-master"
      ~ policy    = jsonencode(
            {
              - Statement = [
                  - {
                      - Action   = [
                          - "sqs:SendMessage",
                          - "sqs:ReceiveMessage",
                          - "sqs:GetQueueUrl",
                          - "sqs:DeleteMessage",
                          - "sqs:ChangeMessageVisibility",
                        ]
                      - Effect   = "Allow"
                      - Resource = "arn:aws:sqs:eu-central-1:175932657549:consul-server-master"
                      - Sid      = "ForMufasa"
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> (known after apply)
        # (1 unchanged attribute hidden)
    }

  # module.consul_server.module.asg.module.target_group[0].random_string.suffix will be updated in-place
  ~ resource "random_string" "suffix" {
        id          = "Xz5M"
        # (12 unchanged attributes hidden)
    }

  # module.ssh_bastion.module.asg.module.policy_name.random_string.suffix will be updated in-place
  ~ resource "random_string" "suffix" {
        id          = "2yrJ"
        # (12 unchanged attributes hidden)
    }

  # module.consul_server.module.asg.module.queue[0].module.lifecycle_role_name.random_string.suffix will be updated in-place
  ~ resource "random_string" "suffix" {
        id          = "qUHM"
        # (12 unchanged attributes hidden)
    }

  # module.consul_server.module.asg.module.queue[0].module.queue_name.random_string.suffix will be updated in-place
  ~ resource "random_string" "suffix" {
        id          = "2GM5"
        # (12 unchanged attributes hidden)
    }

  # module.consul_server.module.asg.module.queue[0].module.sns_policy_name.random_string.suffix will be updated in-place
  ~ resource "random_string" "suffix" {
        id          = "shJF"
        # (12 unchanged attributes hidden)
    }

  # module.consul_server.module.asg.module.queue[0].module.sqs_policy_name.random_string.suffix will be updated in-place
  ~ resource "random_string" "suffix" {
        id          = "b4FZ"
        # (12 unchanged attributes hidden)
    }

Plan: 2 to add, 34 to change, 2 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.
Releasing state lock. This may take a few moments...
```